DataProcessors/ВКонтакте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВКонтакте</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>access_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>owner_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>message</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>file_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>post_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>start_comment_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>domain</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>filter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>post_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ВКонтакте/Forms/Авторизация/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ПраваДоступа = "friends,photos,wall,ads,offline";
	
КонецПроцедуры

&НаКлиенте
// Возвращает для управляемых форм полный путь к форме отчёта, внешней обработки или любого объекта метаданных в виде:
// "Отчет.<ИмяОтчёта>.Форма.ИмяФормы"
// "ВнешняяОбработка.<ИмяВнешнейОбработки>.Форма.ИмяФормы"
// "Документ.<ИмяОбъекта>.Форма.ИмяФормы"
//
// Может быть полезна при встраивании внешней обработки/отчёта в конфигурацию или переименовании объекта, т.к. не требуется изменять вызовы форм. 
//
Функция ПолучитьПолноеИмяФормы(ИмяВызвавшейФормы, ИмяФормы = "") Экспорт
	
    ПозицияТочки = СтрДлина(ИмяВызвавшейФормы);
    Пока Сред(ИмяВызвавшейФормы, ПозицияТочки, 1) <> "." Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла;
    Возврат Лев(ИмяВызвавшейФормы, ПозицияТочки - 1) + ?(ПустаяСтрока(ИмяФормы), "", "." + ИмяФормы);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьКлючДоступа(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ФормаАвторизации = ПолучитьФорму(ПолучитьПолноеИмяФормы(ЭтаФорма.ИмяФормы, "ФормаАвторизации"));
		ФормаАвторизации.Объект.IDПриложения = Объект.IDПриложения;
		ФормаАвторизации.Объект.ПраваДоступа = Объект.ПраваДоступа;
		Результат = ФормаАвторизации.ОткрытьМодально();
		Если Результат <> Неопределено Тогда
			Объект.access_token = Результат;
			ЗапомнитьКлючДоступа();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьКлючДоступа()
	
	РаботаССайтомВКонтакте.access_tokenУстановить(Объект.access_token);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеЗаписейСоСтены(Команда)
	ОткрытьФорму(ПолучитьПолноеИмяФормы(ЭтаФорма.ИмяФормы, "ЧтениеЗаписейСоСтены"));
КонецПроцедуры


&НаКлиенте
Процедура РазмещениеЗаписиНаСтене(Команда)
	ОткрытьФорму(ПолучитьПолноеИмяФормы(ЭтаФорма.ИмяФормы, "РазмещениеЗаписиНаСтене"));
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКомментарииКЗаписиНаСтене(Команда)
	ОткрытьФорму(ПолучитьПолноеИмяФормы(ЭтаФорма.ИмяФормы, "ПолучитьКомментарииКЗаписиНаСтене"));
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКомментарийКЗаписиНаСтене(Команда)
	ОткрытьФорму(ПолучитьПолноеИмяФормы(ЭтаФорма.ИмяФормы, "ДобавитьКомментарийКЗаписиНаСтене"));
КонецПроцедуры
